/*******************************************************Copyright*********************************************************
**                                            北京博创兴盛机器人技术有限公司
**                                                       研发部
**                                               http://robot.up-tech.com
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			Api.h
** 最后修订日期:		2009-05-27
** 最后版本:			1.0
** 描述:				Fractal库的应用程序接口，用于与NorthStar流程图编译环境的联调
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:			律晔
** 创建日期:			2009-05-27
** 版本:				1.0
** 描述:				主要实现对CommandActuator中的功能函数进行标准化封装
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:			
** 修订日期:		
** 版本:			
** 描述:		    
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:			
** 修订日期:	    
** 版本:		    
** 描述:            
**
*************************************************************************************************************************/
#ifndef API_H_
#define API_H_

#include "ConfigTypes.h"

#include "Drivers/Adc.h"
#include "Drivers/Led.h"
#include "Drivers/Gpio.h"

#include "Shell/ServoUnit.h"
#include "Shell/ClockUnit.h"

#include "Apps/SystemInit.h"

//以下是小螃蟹添加的头文件
#include "Drivers/Uart.h"
//上面是小螃蟹添加的头文件
#define		API_GLOBALS

#ifndef   API_GLOBALS
     #define API_EXT     
#else 
     #define API_EXT  extern
#endif 


/*************************************************************************************************************************
                                                         结构体定义
*************************************************************************************************************************/


/*************************************************************************************************************************
                                                       控制结构体声明
*************************************************************************************************************************/


/*************************************************************************************************************************
                                                         函数声明
*************************************************************************************************************************/
API_EXT void MFInit(void);															// 系统初始化

//Delay
API_EXT void DelayMS(int32 inMS);												// 毫秒级延时

//Digi. IO
API_EXT void MFSetPortDirect(uint32 inData);									// 设置IO方向
API_EXT int32 MFGetDigiInput(int32 inID);										// 读取IO输入
API_EXT void MFDigiOutput(int32 inID,int32 inVal);								// 设置IO输出

//AD
API_EXT int32 MFGetAD(int32 inID);												// 读取AD值

//Servo
API_EXT void MFSetServoMode(int32 inID,int32 inMode);							// 舵机模式
API_EXT void MFSetServoPos(int32 inID,int32 inPos,int32 inSpeed);				// 舵机位置设置
API_EXT void MFSetServoRotaSpd(int32 inID,int32 inSpeed);						// 舵机电机模式速度设置
API_EXT int32 MFGetServoPos(int32 inID);										// 读取舵机位置
API_EXT void MFServoAction();													// 运动指令执行
API_EXT void MFInitServoMapping(uint8*, uint8);
//以下是小螃蟹写的函数
API_EXT void MFInitUart(void);
API_EXT void Uart0SetDCB(uint8 mode, uint32 baud);
API_EXT void Uart0Send(uint8 val);
API_EXT void Uart1SetDCB(uint8 mode, uint32 baud);
API_EXT void Uart1Send(uint8 val);
#endif
/*************************************************************************************************************************
**                                                      文件结束
*************************************************************************************************************************/
