/*******************************************************Copyright*********************************************************
**												北京博创兴盛机器人技术有限公司
**                                                       研发部
**                                               http://robot.up-tech.com
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			SystemUnit.h
** 最后修订日期:		2009-03-29
** 最后版本:			1.0
** 描述:				系统信息状态单元，提供系统信息察看接口，系统初始化接口。
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:			律晔
** 创建日期:			2009-03-29
** 版本:				1.0
** 描述:				实现系统信息查询。
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************************/
#ifndef SYSTEMUNIT_H_
#define SYSTEMUNIT_H_

#include "ConfigTypes.h"
#include "Drivers/Uart.h"
#include "Lib/UpRobotProtocol.h"


#define			SYSTEMUNIT_GLOBALS

#ifndef			SYSTEMUNIT_GLOBALS
     #define	SYSTEMUNIT_EXT
#else 
     #define	SYSTEMUNIT_EXT  extern
#endif 


/*************************************************************************************************************************
														参数宏定义
*************************************************************************************************************************/


/*************************************************************************************************************************
														功能模块结构定义
*************************************************************************************************************************/

/************************************************************************************************************************/
/*												系统状态控制结构体的结构定义												*/
typedef struct SPowerControl
{
	uint8 current_voltage;												// 当前系统电压
	uint8 max_voltage;													// 高压报警线
	uint8 min_voltage;													// 低压报警线

	//pReadBasicInfo;
	//pReadCurrentVoltage;
	//pReadMaxVoltage;
	//pReadMinVoltage;
	//pSetMaxVoltage;
	//pSetMinVoltage;
	//pSetError;
	//pReadError;
	//pSetAbnormality;
	//pReadAbnormality;
}POWER_CONTROL_STRUCT;






/*************************************************************************************************************************
 *													功能模块编号定义
*************************************************************************************************************************/
#define	SYSTEM_INFO							0x00
#define	SYSTEM_STATE						0x01
#define	MAIN_COMMUNICATION					0x04
#define	MINOR_COMMUNICATION					0x05
#define	GPIO_PORT							0x06
#define	ADC_SAMPLING						0x07
#define	SERVO_MOTOR							0x08
#define AUDIO_BUZZER						0x09
#define SIGNAL_CONTROLER					0xA0


/*************************************************************************************************************************
 *													功能模块结构定义
*************************************************************************************************************************/

/************************************************************************************************************************/
/*		使用UpRobot协议栈的通讯端口控制结构体的结构定义		*/
#define SLAVE_STACK 				0x10										// 从栈标志
#define MASTER_STACK 				0x11										// 主栈标志
#define UPROBOT_BROADCAST_ID		0xFE										// 广播ID

#define ABNORMAL_MASK				0b11000000									// 系统异常为遮罩

typedef struct SCommunicationPort
{
	UART_CONTROL_STRUCT* p_uart_control;										// 硬件控制结构体指针
	UPROBOT_STACK_STR_STRUCT str_stack;											// 建立协议栈结构体

	uint8 mode;																	// 模式标志
	uint8 local_id;																// 本端口ID
	uint32 baudrate;															// 本端口波特率
	uint8 state;																// 通讯状态标志，该标志的低6位为通讯错误标志
																				// 高2位为系统异常标志
	// 模式转换函数
	// 本机ID转换函数
	// 波特率转换函数

	// 初始化函数
}COMMUNICATION_PORT_STRUCT;


/*************************************************************************************************************************
                                                       控制结构体声明
*************************************************************************************************************************/
SYSTEMUNIT_EXT COMMUNICATION_PORT_STRUCT main_communication;				// 主通讯端口控制结构


#endif
/*************************************************************************************************************************
**                                                      文件结束
*************************************************************************************************************************/
