/*******************************************************Copyright*********************************************************
**                                            北京博创兴盛机器人技术有限公司
**                                                       研发部
**                                               http://robot.up-tech.com
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			Timer.c
** 最后修订日期:		2009-03-06
** 最后版本:			1.0
** 描述:				使用16位TIMER的快速PWM模式实现2.5ms溢出中断与0.5-2.49ms可变的比较中断
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:			律晔
** 创建日期:			2009-03-18
** 版本:				1.0
** 描述:				2.5ms溢出中断为系统使用的操作，溢出中断在Kernel中的Isp.c中处理，比较匹配中断在Api中的Ppm.c中处理
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:			
** 修订日期:		
** 版本:			
** 描述:		    
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:			
** 修订日期:	    
** 版本:		    
** 描述:            
**
*************************************************************************************************************************/
#include "Drivers/Timer.h"


/*************************************************************************************************************************
** 函数名称:			SetTimer0Mode
**
** 函数描述:			设置Timer1的模式
**
**					TIMER8_MODE_NORMAL
**					TIMER8_MODE_PWM_P
**					TIMER8_MODE_CTC_OCR
**					TIMER8_MODE_PWM_FA
**
** 输入变量:		    uint8 mode
** 返回值:		    void
**
** 使用宏或常量:		Timer.h中定义的模式掩码;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-06-09
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer0Mode(uint8 mode)
{
	uint8 temp_wgm0 = 0, temp_wgm1 = 0;

	temp_wgm0 = (mode & 0x01) << TIMER8_WGM0_OFFSET;						// 取出bit0；移动到bit6
	temp_wgm1 = (mode & 0x02) << TIMER8_WGM1_OFFSET;						// 取出bit1，移动到bit3

	SetRegMask(TIMER0_TCCR, TIMER8_WGM_MASK, (temp_wgm0 | temp_wgm1));		// 设置模式寄存器低位
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1Mode
**
** 函数描述:			设置Timer1的模式
**
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		Timer.h中定义的模式掩码;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-06-09
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1Mode(uint8 mode)
{
	uint8 temp_wgm32 = 0, temp_wgm10 = 0;

	temp_wgm32 = (mode & 0x0C) << 1;										// 取出bit3，bit2；移动到bit4，bit3
	temp_wgm10 = (mode & TIMER16_WGM10_MASK);								// 取出bit1，bit0

	SetRegMask(TIMER1_TCCRA, TIMER16_WGM10_MASK, temp_wgm10);				// 设置模式寄存器低位
	SetRegMask(TIMER1_TCCRB, TIMER16_WGM32_MASK, temp_wgm32);				// 设置模式寄存器高位
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3Mode
**
** 函数描述:			设置Timer3的模式
**
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		Timer.h中定义的模式掩码;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3Mode(uint8 mode)
{
	uint8 temp_wgm32 = 0, temp_wgm10 = 0;

	temp_wgm32 = (mode & 0x0C) << 1;										// 取出bit3，bit2；移动到bit4，bit3
	temp_wgm10 = (mode & TIMER16_WGM10_MASK);								// 取出bit1，bit0

	SetRegMask(TIMER3_TCCRA, TIMER16_WGM10_MASK, temp_wgm10);				// 设置模式寄存器低位
	SetRegMask(TIMER3_TCCRB, TIMER16_WGM32_MASK, temp_wgm32);				// 设置模式寄存器高位
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1Prescale
**
** 函数描述:			设置Timer1的模式
**
**
** 输入变量:			void
** 返回值:			void
**
** 使用宏或常量:		Timer.h中定义的模式掩码;
** 使用全局变量:		None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-06-09
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1Prescale(uint8 prescale)
{
	uint8 temp_cs = 0;

	temp_cs = prescale & 0x07;												// 提取有效位

	SetRegMask(TIMER1_TCCRB, TIMER_CS_MASK, temp_cs);						// 设置分频控制寄存器
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3Prescale
**
** 函数描述:			设置Timer3的模式
**
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		Timer.h中定义的模式掩码;
** 使用全局变量:		None;
**
** 调用函数:			SetRegMask;
**
** 创建人:		 	律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3Prescale(uint8 prescale)
{
	uint8 temp_cs = 0;

	temp_cs = prescale & 0x07;												// 提取有效位

	SetRegMask(TIMER3_TCCRB, TIMER_CS_MASK, temp_cs);						// 设置分频控制寄存器
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1CounterRegister
**
** 函数描述:			设置定时计数寄存器值
**
**
** 输入变量:			val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:		None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-08-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1CounterRegister(uint16 val)
{
	Out16(TIMER1_TCNT_L, TIMER1_TCNT_H, val);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3CounterRegister
**
** 函数描述:			设置定时计数寄存器值
**
**
** 输入变量:			val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:		None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3CounterRegister(uint16 val)
{
	Out16(TIMER3_TCNT_L, TIMER3_TCNT_H, val);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1Interrupt
**
** 函数描述:			使能Timer1的特定中断,输入参量为：
**
** 						TIMER16_IMR_OCIC			比较C中断
** 						TIMER16_IMR_ICI				输入捕捉中断
**						TIMER16_IMR_OCIA			比较A中断
**						TIMER16_IMR_OCIB			比较B中断
**						TIMER16_IMR_OI				溢出中断
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-01
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void EnableTimer1Interrupt(uint8 number)
{
	if (number < 0x08)
	{
		SetRegBit(TIMER_TIMSK, number);
	}
	else
	{
		SetRegBit(TIMER_ETIMSK, OCIE1C);
	}
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3Interrupt
**
** 函数描述:			使能Timer3的特定中断,输入参量为：
**
** 						TIMER16_IMR_OCIC			比较C中断
** 						TIMER16_IMR_ICI				输入捕捉中断
**						TIMER16_IMR_OCIA			比较A中断
**						TIMER16_IMR_OCIB			比较B中断
**						TIMER16_IMR_OI				溢出中断
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void EnableTimer3Interrupt(uint8 number)
{
	if (number < 0x08)
	{
		SetRegBit(TIMER_ETIMSK, number);
	}
	else
	{
		SetRegBit(TIMER_ETIMSK, OCIE3C);
	}
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1Interrupt
**
** 函数描述:			关闭Timer1的特定中断
**
** 						TIMER16_IMR_OCIC			比较C中断
** 						TIMER16_IMR_ICI				输入捕捉中断
**						TIMER16_IMR_OCIA			比较A中断
**						TIMER16_IMR_OCIB			比较B中断
**						TIMER16_IMR_OI				溢出中断
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-01
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void DisableTimer1Interrupt(uint8 number)
{
	if (number < 0x08)
	{
		ClrRegBit(TIMER_TIMSK, number);
	}
	else
	{
		ClrRegBit(TIMER_ETIMSK, OCIE1C);
	}
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3Interrupt
**
** 函数描述:			关闭Timer3的特定中断
**
** 						TIMER16_IMR_OCIC			比较C中断
** 						TIMER16_IMR_ICI				输入捕捉中断
**						TIMER16_IMR_OCIA			比较A中断
**						TIMER16_IMR_OCIB			比较B中断
**						TIMER16_IMR_OI				溢出中断
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void DisableTimer3Interrupt(uint8 number)
{
	if (number < 0x08)
	{
		ClrRegBit(TIMER_ETIMSK, number);
	}
	else
	{
		ClrRegBit(TIMER_ETIMSK, OCIE3C);
	}
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1CompareOutputAMode
**
** 函数描述:			设置比较匹配输出模式
**
** 						TIMER_PWM_DISCONNECT		0x00		不连接
** 						TIMER_PWM_TOGGLE			0x01		匹配时取反
** 						TIMER_PWM_CLEAR				0x02		匹配时清零
** 						TIMER_PWM_SET				0x03		匹配时置位
**
** 输入变量:		    mode;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-10
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1CompareOutputAMode(uint8 mode)
{
	mode = (mode & 0x03) << 6;
	SetRegMask(TIMER1_TCCRA, TIMER16_COMA_MASK, mode);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3CompareOutputAMode
**
** 函数描述:			设置比较匹配输出模式
**
** 						TIMER_PWM_DISCONNECT		0x00		不连接
** 						TIMER_PWM_TOGGLE			0x01		匹配时取反
** 						TIMER_PWM_CLEAR				0x02		匹配时清零
** 						TIMER_PWM_SET				0x03		匹配时置位
**
** 输入变量:		    mode;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3CompareOutputAMode(uint8 mode)
{
	mode = (mode & 0x03) << 6;
	SetRegMask(TIMER3_TCCRA, TIMER16_COMA_MASK, mode);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1CompareOutputBMode
**
** 函数描述:			设置比较匹配输出模式
**
** 						TIMER_PWM_DISCONNECT		0x00		不连接
** 						TIMER_PWM_TOGGLE			0x01		匹配时取反
** 						TIMER_PWM_CLEAR				0x02		匹配时清零
** 						TIMER_PWM_SET				0x03		匹配时置位
**
** 输入变量:		    mode;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-10
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1CompareOutputBMode(uint8 mode)
{
	mode = (mode & 0x03) << 4;
	SetRegMask(TIMER1_TCCRA, TIMER16_COMB_MASK, mode);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3CompareOutputBMode
**
** 函数描述:			设置比较匹配输出模式
**
** 						TIMER_PWM_DISCONNECT		0x00		不连接
** 						TIMER_PWM_TOGGLE			0x01		匹配时取反
** 						TIMER_PWM_CLEAR				0x02		匹配时清零
** 						TIMER_PWM_SET				0x03		匹配时置位
**
** 输入变量:		    mode;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-10
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3CompareOutputBMode(uint8 mode)
{
	mode = (mode & 0x03) << 4;
	SetRegMask(TIMER3_TCCRA, TIMER16_COMB_MASK, mode);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1CompareRegisterA
**
** 函数描述:			设置比较寄存器A缓冲
**
**
** 输入变量:		    val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-14
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1CompareRegisterA(uint16 val)
{
	Out16(TIMER1_OCRA_L, TIMER1_OCRA_H, val);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3CompareRegisterA
**
** 函数描述:			设置比较寄存器A缓冲
**
**
** 输入变量:		    val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3CompareRegisterA(uint16 val)
{
	Out16(TIMER3_OCRA_L, TIMER3_OCRA_H, val);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1CompareRegisterB
**
** 函数描述:			设置比较寄存器B缓冲
**
**
** 输入变量:			val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-14
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1CompareRegisterB(uint16 val)
{
	Out16(TIMER1_OCRB_L, TIMER1_OCRB_H, val);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3CompareRegisterB
**
** 函数描述:			设置比较寄存器B缓冲
**
**
** 输入变量:			val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3CompareRegisterB(uint16 val)
{
	Out16(TIMER3_OCRB_L, TIMER3_OCRB_H, val);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer1CaptureRegister
**
** 函数描述:			设置输入捕捉寄存器
**
**
** 输入变量:			uint16 val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:		None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-07-14
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer1CaptureRegister(uint16 val)
{
	Out16(TIMER1_ICR_L, TIMER1_ICR_H, val);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer3CaptureRegister
**
** 函数描述:			设置输入捕捉寄存器
**
**
** 输入变量:			uint16 val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:		None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-10-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer3CaptureRegister(uint16 val)
{
	Out16(TIMER3_ICR_L, TIMER3_ICR_H, val);
}


/*************************************************************************************************************************
** 函数名称:			InitTimer1
**
** 函数描述:			初始化Timer1；
**
**
**
**
** 输入变量:		    void
** 返回值:			void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetReg; Out16;
**
** 创建人:			律晔
** 创建日期:			2009-08-07
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void InitTimer1(void)
{
	SetReg(timer1_control.state , 0);

	SetTimer1CaptureRegister(0x20FF);
	SetTimer1CompareRegisterA(0x0400);

	SetTimer1Mode(TIMER16_MODE_NORMAL);									// 默认为标准模式

	SetTimer1Prescale(TIMER16_PRESCALE_STOP);							// 计数停止

	timer1_control.pSetCompareRegisterA = SetTimer1CompareRegisterA;
	timer1_control.pSetCompareRegisterB = SetTimer1CompareRegisterB;
	timer1_control.pSetCaptureRegister = SetTimer1CaptureRegister;
	timer1_control.pSetMode = SetTimer1Mode;
	timer1_control.pSetPrescaler = SetTimer1Prescale;
	timer1_control.pSetCounterRegister = SetTimer1CounterRegister;
	timer1_control.pSetCompareOutputAMode = SetTimer1CompareOutputAMode;
	timer1_control.pSetCompareOutputBMode = SetTimer1CompareOutputBMode;
	timer1_control.pEnableInterrupt = EnableTimer1Interrupt;
	timer1_control.pDisableInterrupt = DisableTimer1Interrupt;

	SetRegBit(timer1_control.state , INIT_COMPLETE);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer2CompareRegister
**
** 函数描述:			设置比较寄存器B缓冲
**
**
** 输入变量:		    uint8 val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-08-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
//static void SetTimer2CompareRegister(uint8 val)
//{
//	SetReg(TIMER2_OCR, val);
//}


/*************************************************************************************************************************
** 函数名称:			SetTimer2CompareOutputMode
**
** 函数描述:			设置比较匹配输出模式
**
** 					TIMER_PWM_DISCONNECT		0x00		不连接
** 					TIMER_PWM_TOGGLE			0x01		匹配时取反
** 					TIMER_PWM_CLEAR				0x02		匹配时清零
** 					TIMER_PWM_SET				0x03		匹配时置位
**
** 输入变量:		    uint8 mode;
** 返回值:		    void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-08-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
//static void SetTimer2CompareOutputMode(uint8 mode)
//{
//	mode = (mode & 0x03) << 4;
//	SetRegMask(TIMER2_TCCRA, TIMER2_COMB_MASK, mode);
//}


/*************************************************************************************************************************
** 函数名称:			SetTimer0Prescale
**
** 函数描述:			设置Timer0的模式
**
**
** 输入变量:		    void
** 返回值:			void
**
** 使用宏或常量:		Timer.h中定义的模式掩码;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-06-09
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer0Prescale(uint8 prescale)
{
	uint8 temp_cs = 0;

	temp_cs = prescale & 0x07;												// 提取有效位

	SetRegMask(TIMER0_TCCR, TIMER_CS_MASK, temp_cs);						// 设置分频控制寄存器
}


/*************************************************************************************************************************
** 函数名称:			SetTimer0CounterRegister
**
** 函数描述:			设置定时计数寄存器值
**
**
** 输入变量:		    uint8 val;
** 返回值:			void;
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-08-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void SetTimer0CounterRegister(uint8 val)
{
	SetReg(TIMER0_TCNT, val);
}


/*************************************************************************************************************************
** 函数名称:			EnableTimer0Interrupt
**
** 函数描述:			使能Timer0的特定中断,输入参量为：
**
**					TIMER0_IMR_OCI		T/C0 输出比较匹配中断使能
**					TIMER0_IMR_OI		T/C0 溢出中断使能
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-08-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void EnableTimer0Interrupt(uint8 number)
{
	SetRegBit(TIMER_TIMSK, number);
}


/*************************************************************************************************************************
** 函数名称:			SetTimer0Interrupt
**
** 函数描述:			关闭Timer0的特定中断
**
**					TIMER0_IMR_OCI		T/C0 输出比较匹配中断使能
**					TIMER0_IMR_OI		T/C0 溢出中断使能
**
** 输入变量:		    void
** 返回值:		    void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetRegMask;
**
** 创建人:			律晔
** 创建日期:			2009-08-06
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void DisableTimer0Interrupt(uint8 number)
{
	ClrRegBit(TIMER_TIMSK, number);
}


/*************************************************************************************************************************
** 函数名称:			InitTimer0
**
** 函数描述:			设置定时器为256分频，使能溢出中断
**
**
** 输入变量:			void
** 返回值:			void
**
** 使用宏或常量:		None;
** 使用全局变量:	    None;
**
** 调用函数:			SetReg; Out16;
**
** 创建人:			律晔
** 创建日期:			2009-08-07
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void InitTimer0(void)
{
	SetReg(timer0_control.state , 0);

	SetTimer0Prescale(TIMER0_PRESCALE_STOP);
	SetTimer0Mode(TIMER8_MODE_NORMAL);

	SetTimer0CounterRegister(TIMER0_RELOAD_VAL);
	SetTimer0Prescale(TIMER0_PRESCALE_INIT);

	EnableTimer0Interrupt(TIMER8_IMR_OI);

	timer0_control.pSetMode = SetTimer0Mode;
	timer0_control.pSetPrescaler = SetTimer0Prescale;
	timer0_control.pSetCounterRegister = SetTimer0CounterRegister;
	timer0_control.pEnableInterrupt = EnableTimer0Interrupt;
	timer0_control.pDisableInterrupt = DisableTimer0Interrupt;

	SetRegBit(timer0_control.state , INIT_COMPLETE);
}


/*************************************************************************************************************************
** 函数名称:			InitTimer3
**
** 函数描述:		    TIMER initialize - prescale:1
**					WGM: 12) CTC, TOP=ICRn
**					Desired value: 2.5mSec
** 					 
**					                 
** 输入变量:			void
** 返回值:			void
**
** 使用宏或常量:		None;
** 使用全局变量:		None;
**
** 调用函数:			SetReg; Out16;
**
** 创建人:			律晔
** 创建日期:			2009-08-07
**------------------------------------------------------------------------------------------------------------------------
** 修订人:              
** 修订日期:            
**------------------------------------------------------------------------------------------------------------------------
*************************************************************************************************************************/
static void InitTimer3(void)
{
	SetReg(timer3_control.state , 0);	

	SetTimer1CaptureRegister(TIMER3_TOP_VAL);
	SetTimer1CompareRegisterA(TIMER3_INIT_COM_VAL);

	SetTimer3Mode(TIMER16_MODE_NORMAL);									// 默认为标准模式

	SetTimer3Prescale(TIMER16_PRESCALE_STOP);							// 计数停止

	timer3_control.pSetCompareRegisterA = SetTimer3CompareRegisterA;
	timer3_control.pSetCompareRegisterB = SetTimer3CompareRegisterB;
	timer3_control.pSetCaptureRegister = SetTimer3CaptureRegister;
	timer3_control.pSetMode = SetTimer3Mode;
	timer3_control.pSetPrescaler = SetTimer3Prescale;
	timer3_control.pSetCounterRegister = SetTimer3CounterRegister;
	timer3_control.pSetCompareOutputAMode = SetTimer3CompareOutputAMode;
	timer3_control.pSetCompareOutputBMode = SetTimer3CompareOutputBMode;
	timer3_control.pEnableInterrupt = EnableTimer3Interrupt;
	timer3_control.pDisableInterrupt = DisableTimer3Interrupt;
	
	SetTimer3Prescale(TIMER16_PRESCALE_1);								// 1分配

	EnableTimer3Interrupt(TIMER16_IMR_OCIA);
	EnableTimer3Interrupt(TIMER16_IMR_OI);								// 开中断

	SetRegBit(timer3_control.state , INIT_COMPLETE);
	
}


/*************************************************************************************************************************
                                                       控制结构体声明
*************************************************************************************************************************/
TIMER16_CONTROL_STRUCT timer3_control = \
{	\
	.pInit = InitTimer3	\
};

TIMER8_CONTROL_STRUCT timer0_control = \
{	\
	.pInit = InitTimer0	\
};

TIMER16_CONTROL_STRUCT timer1_control = \
{	\
	.pInit = InitTimer1	\
};


/*************************************************************************************************************************
**                                                      文件结束
*************************************************************************************************************************/
