/*******************************************************Copyright*********************************************************
**                                            北京博创兴盛机器人技术有限公司
**                                                       研发部
**                                               http://robot.up-tech.com
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			ExtInt.h
** 最后修订日期:		2009-08-17
** 最后版本:			1.0
** 描述:				 外部中断的接口函数，控制外部中断的初始化，工作模式。
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:			律晔
** 创建日期:			2008-08-17
** 版本:				1.0
** 描述:				外部中断的接口函数，控制外部中断的初始化，工作模式。
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************************/
#ifndef EXTINT_H_
#define EXTINT_H_

#include "ConfigTypes.h"


#define		EXTINT_GLOBALS

#ifndef   EXTINT_GLOBALS
     #define EXTINT_EXT
#else
     #define EXTINT_EXT  extern
#endif


/*************************************************************************************************************************
														硬件定义
*************************************************************************************************************************/
#define EXTINT_EICRA				EICRA					// 外部中断控制寄存器 A
/*************************************************************************************************************************
 *   7     6     5     4     3     2     1     0
 * ISC31 ISC30 ISC21 ISC20 ISC11 ISC10 ISC01 ISC00
 *
 * Bits 7..0 – ISC31, ISC30 – ISC00, ISC00: 外部中断 3 - 0 敏感电平控制位
 *
 * ISCn1	ISCn0			说明
 *   0		  0		INTn 为低电平时产生中断请求
 *   0		  1		保留
 *   1		  0		INTn 的下降沿产生异步中断请求
 *   1		  0		INTn 的上升沿产生异步中断请求
 *
 * tINT	异步 ( 外部 ) 中断的最小脉冲宽度	50ns
*************************************************************************************************************************/

#define EXTINT_EICRB				EICRB					// 外部中断控制寄存器 B
/*************************************************************************************************************************
 *   7     6     5     4     3     2     1     0
 * ISC71 ISC70 ISC61 ISC60 ISC51 ISC50 ISC41 ISC40
 *
 * Bits 7..0 – ISC71, ISC70 - ISC41, ISC40: 外部中断 7 - 4 敏感电平控制位
 *
 * ISCn1	ISCn0			说明
 *   0		  0		INTn 为低电平时产生中断请求
 *   0		  1		INTn 引脚上任意的逻辑电平变换都将引发中断
 *   1		  0		只要两次采样发现 INTn 上发生了下降沿就会产生中断请求
 *   1		  1		只要两次采样发现 INTn 上发生了上升沿就会产生中断请求
 *
 * 改变 ISCn1/ISCn0 时一定要先通过清零 EIMSK 寄存器的中断使能位来禁止中断。否
 * 则在改变 ISCn1/ISCn0 的过程中可能发生中断。
*************************************************************************************************************************/

#define EXTINT_EIMSK				EIMSK					// 外部中断屏蔽寄存器
/*************************************************************************************************************************
 *  7    6    5    4    3    2    1     0
 * INT7 INT6 INT5 INT4 INT3 INT2 INT1 IINT0
 *
 * Bits 7..0 – INT7 – INT0: 外部中断请求 7 - 0 使能
 *
 * 当 INT7 – INT0 为 '1’,而且状态寄存器 SREG 的 I 标志置位,相应的外部引脚中断就使能了。
*************************************************************************************************************************/

#define EXTINT_EIFR					EIFR					// 外部中断标志寄存器
/*************************************************************************************************************************
 *  7     6     5     4     3     2     1      0
 * INTF7 INTF6 INTF5 INTF4 INTF3 INTF2 INTF1 IINTF0
 *
 * Bits 7..0 – INTF7 - INTF0: 外部中断标志 7 - 0
 *
 * INT7:0 引脚电平发生跳变时触发中断请求,并置位相应的中断标志 INTF7:0
 * 标志位也可以通过写入 ’1’ 的方式来清零。
*************************************************************************************************************************/

#define EXTINT_PORT_INT0			PORTD
#define EXTINT_PORT_INT1			PORTD
#define EXTINT_PORT_INT2			PORTD
#define EXTINT_PORT_INT3			PORTD

#define EXTINT_PORT_INT4			PORTE
#define EXTINT_PORT_INT5			PORTE
#define EXTINT_PORT_INT6			PORTE
#define EXTINT_PORT_INT7			PORTE

#define EXTINT_PORT_BIT_INT0		PD0
#define EXTINT_PORT_BIT_INT1		PD1
#define EXTINT_PORT_BIT_INT2		PD2
#define EXTINT_PORT_BIT_INT3		PD3

#define EXTINT_PORT_BIT_INT4		PE4
#define EXTINT_PORT_BIT_INT5		PE5
#define EXTINT_PORT_BIT_INT6		PE6
#define EXTINT_PORT_BIT_INT7		PE7

#define EXTINT_DDR_INT0				DDRD
#define EXTINT_DDR_INT1				DDRD
#define EXTINT_DDR_INT2				DDRD
#define EXTINT_DDR_INT3				DDRD

#define EXTINT_DDR_INT4				DDRE
#define EXTINT_DDR_INT5				DDRE
#define EXTINT_DDR_INT6				DDRE
#define EXTINT_DDR_INT7				DDRE

#define EXTINT_DDR_BIT_INT0			DDD0
#define EXTINT_DDR_BIT_INT1			DDD1
#define EXTINT_DDR_BIT_INT2			DDD2
#define EXTINT_DDR_BIT_INT3			DDD3

#define EXTINT_DDR_BIT_INT4			DDE4
#define EXTINT_DDR_BIT_INT5			DDE5
#define EXTINT_DDR_BIT_INT6			DDE6
#define EXTINT_DDR_BIT_INT7			DDE7

/*************************************************************************************************************************
														控制参数定义
*************************************************************************************************************************/
#define EXTINT_INT0					0x00
#define EXTINT_INT1					0x01
#define EXTINT_INT2					0x02
#define EXTINT_INT3					0x03
#define EXTINT_INT4					0x04
#define EXTINT_INT5					0x05
#define EXTINT_INT6					0x06
#define EXTINT_INT7					0x07

#define EXTINT_MODE_MASK			0x03

#define EXTINT_MODE_LOW				0x00			// 点电平触发
#define EXTINT_MODE_CHANGE			0x01			// 电平变化触发(对INT0－INT3无效)
#define EXTINT_MODE_FALLING			0x02			// 下降沿触发
#define EXTINT_MODE_RISING			0x03			// 上升沿触发


/*************************************************************************************************************************
														结构体定义
*************************************************************************************************************************/
typedef struct SExtIntControl
{
	uint8				state;					// 状态字

	tVoidVoid*			pInit;					// 初始化函数
	tVoidUint8Uint8*	pSetMode;				// 设置中断触发条件
	tVoidUint8*			pEnableInterrupt;		// 使能中断
	tVoidUint8*			pDisableInterrupt;		// 禁用中断
}EXTINT_CONTROL_STRUCT;


/*************************************************************************************************************************
														 控制结构体声明
*************************************************************************************************************************/
EXTINT_EXT EXTINT_CONTROL_STRUCT extint_control;


/*************************************************************************************************************************
														 函数声明
*************************************************************************************************************************/


#endif
/*************************************************************************************************************************
** 														文件结束
*************************************************************************************************************************/
