/*******************************************************Copyright*********************************************************
**                                            北京博创兴盛机器人技术有限公司
**                                                       研发部
**                                               http://robot.up-tech.com
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			Led.h
** 最后修订日期:		2009-03-18
** 最后版本:			1.0
** 描述:				Gpio控制函数接口，包含对PPM输出端口的定义(API)
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:			律晔
** 创建日期:			2009-03-18
** 版本:				1.0
** 描述:				Gpio控制函数接口，包含对PPM输出端口的定义(API)
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:			
** 修订日期:		
** 版本:			
** 描述:		    
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:			
** 修订日期:	    
** 版本:		    
** 描述:            
**
*************************************************************************************************************************/
#ifndef LED_H_
#define LED_H_

#include "ConfigTypes.h"

#define		LED_GLOBALS

#ifndef   LED_GLOBALS
     #define LED_EXT     
#else 
     #define LED_EXT  extern
#endif 


#define LED_PORT_ALONE			0
/*************************************************************************************************************************
                                                  LED端口定意
*************************************************************************************************************************/
#if LED_PORT_ALONE
	
	#define LED0_PORT			PORTA		
	#define LED0_PORT_BIT		PA4	
	#define LED0_DDR			DDRA	
	#define LED0_DDR_BIT		DDA4

	#define LED1_PORT			PORTA		
	#define LED1_PORT_BIT		PA5	
	#define LED1_DDR			DDRA	
	#define LED1_DDR_BIT		DDA5

	#define LED2_PORT			PORTA		
	#define LED2_PORT_BIT		PA6	
	#define LED2_DDR			DDRA	
	#define LED2_DDR_BIT		DDA6

	#define LED3_PORT			PORTA		
	#define LED3_PORT_BIT		PA7
	#define LED3_DDR			DDRA	
	#define LED3_DDR_BIT		DDA7
	
#else

	#define LED_PORT			PORTA
	#define LED_DDR				DDRA
	#define LED_MASK			0b11110000
	#define LED_BIT_BOTTOM		4
	
#endif

#define LED_AMOUNT				4


/*************************************************************************************************************************
                                                         结构体定义
*************************************************************************************************************************/
typedef void (tInitLed)(void);
typedef void (tSetLedGroup)(uint8 val);
typedef void (tClrLedBit)(uint8 val);
typedef void (tSetLedBit)(uint8 val);
typedef void (tChangeLedBit)(uint8 val);


typedef struct
{
	volatile uint8 state;;

	tInitLed* pInit;
	tSetLedGroup* pSetLedGroup;
	tClrLedBit* pClrLedBit;
	tSetLedBit* pSetLedBit;
	tChangeLedBit* pChangeLedBit;
}LED_CONTROL_STRUCT;


/*************************************************************************************************************************
                                                       控制结构体声明
*************************************************************************************************************************/
LED_EXT LED_CONTROL_STRUCT led_control;


/*************************************************************************************************************************
                                                         函数声明
*************************************************************************************************************************/

#endif
/*************************************************************************************************************************
**                                                      文件结束
*************************************************************************************************************************/
