/*******************************************************Copyright*********************************************************
**                                            北京博创兴盛机器人技术有限公司
**                                                       研发部
**                                               http://robot.up-tech.com
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			Sim.h
** 最后修订日期:		2009-11-20
** 最后版本:			1.0
** 描述:				内部外部RAM选择，电源模式设置，中断向量位置设置，看门狗设置等系统控制方法的编程接口
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:			律晔
** 创建日期:			2009-11-20
** 版本:				1.0
** 描述:				主要目的为实现系统初始化算法和Reset算法
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************************/
#ifndef SIM_H_
#define SIM_H_

#include "ConfigTypes.h"


#define		SIM_GLOBALS

#ifndef		SIM_GLOBALS
	#define	SIM_EXT
#else
	#define	SIM_EXT  extern
#endif


/*************************************************************************************************************************
														硬件定义
*************************************************************************************************************************/
#define SIM_XDIV				XDIV					// XTAL 分频控制寄存器
/*************************************************************************************************************************
 *   7     6     5     4     3     2     1     0
 * XDIVEN XDIV6 XDIV5 XDIV4 XDIV3 XDIV2 XDIV1 XDIV0
 *
 * Bit 7 – XDIVEN: XTAL 分频使能
 *
 * 		XDIVEN 为"1“ 时 CPU 和其他外设的时钟频率(clkI/O、clkADC、clkCPU、clkFLASH) 以XDIV6 - XDIV0
 * 		确定的数值为因子进行分频。这一位可以在运行的过程当中进行修改。
 *
 * Bits 6..0 – XDIV6..XDIV0: XTAL 分频选择位6 - 0
 *
 * 		XDIV6 - XDIV0 定义了系统使用的分频因子。假定其数值以d 表示，分频之后的CPU 和其
 * 		他外设的时钟频率fCLK 计算公式为：
 * 		fCLK = Source clock / (129 - d)
 * 		只有在XDIVEN为零时才可以修改这些数据。对XDIVEN写"1“时，同时写入XDIV6..XDIV0
 * 		的数据立即生效。否则这些数据无效。由于分频器分频的是 输入到MCU 的主时钟，外设
 * 		的时钟同时也被分频。
*************************************************************************************************************************/

#define SIM_XMCRA			XMCRA					// 外部存储器控制寄存器A
/*************************************************************************************************************************
 *	7		6		5		4		3		2		1		0
 *	–		SRL2	SRL1	SRL0	SRW01	SRW00	SRW11	–
 *
 * Bit 6..4 – SRL2, SRL1, SRL0: 等待状态存储器区限制
 *
 * 	SRL2	SRL1	SRL0	分区限制
 * 	0		0		0		低地址存储器区 = N/A
 * 							高地址存储器区 = 0x1100 - 0xFFFF
 * 	0		0		1		低地址存储器区 = 0x1100 - 0x1FFF
 * 							高地址存储器区 = 0x2000 - 0xFFFF
 * 	0		1		0		低地址存储器区 = 0x1100 - 0x3FFF
 * 							高地址存储器区 = 0x4000 - 0xFFFF
 * 	0		1		1		低地址存储器区 = 0x1100 - 0x5FFF
 * 							高地址存储器区 = 0x6000 - 0xFFFF
 * 	1		0		0		低地址存储器区 = 0x1100 - 0x7FFF
 * 							高地址存储器区 = 0x8000 - 0xFFFF
 * 	1		0		1		低地址存储器区 = 0x1100 - 0x9FFF
 * 							高地址存储器区 = 0xA000 - 0xFFFF
 * 	1		1		0		低地址存储器区 = 0x1100 - 0xBFFF
 * 							高地址存储器区 = 0xC000 - 0xFFFF
 * 	1		1		1		低地址存储器区 = 0x1100 - 0xDFFF
 * 							高地址存储器区 = 0xE000 - 0xFFFF
 *
 * Bit 1 和MCUCR 的Bit 6 – SRW11, SRW10: 高地址存储器区等待状态选择位
 *
 * 	SRW11 和SRW10 用来控制外部存储器高地址区等待状态的数目
 *
 * Bit 3..2 – SRW01, SRW00: 低地址存储器区等待状态选择位
 *
 *	SRW01 和SRW00 用来控制外部存储器低地址区等待状态的数目
 *
 *	SRWn1	SRWn0	等待状态
 *	0		0		无等待周期
 *	0		1		读/ 写操作插入一个等待周期
 *	1		0		读/ 写操作插入两个等待周期
 *	1		1		读/ 写操作插入两个等待周期。输出新地址之前还要插入一个等待周期
*************************************************************************************************************************/

#define SIM_XMCRB			XMCRB					// 外部存储器控制寄存器B
/*************************************************************************************************************************
 *	7		6		5		4		3		2		1		0
 *	XMBK	–		–		–		–		XMM2	XMM1	XMM0
 *
 * Bit 7– XMBK: 外部存储器总线保持功能使能
 *
 * Bit 2..0 – XMM2, XMM1, XMM0: 外部存储器高位地址屏蔽
 *
 * 	XMM2	XMM1	XMM0	外部存储器地址的位数		可以释放的端口引脚
 * 	0		0		0		8(全部60 KB 地址空间)	无
 * 	0		0		1		7						PC7
 * 	0		1		0		6						PC7 - PC6
 * 	0		1		1		5						PC7 - PC5
 * 	1		0		0		4						PC7 - PC4
 * 	1		0		1		3						PC7 - PC3
 *	1		1		0		2						PC7 - PC2
 * 	1		1		1		没有高位地址				端口C 的全部引脚
*************************************************************************************************************************/

#define SIM_MCUCR			MCUCR					// MCU 控制寄存器
/*************************************************************************************************************************
 *  7		6		5		4		3		2		1		0
 * 	SRE		SRW10	SE		SM1		SM0		SM2		IVSEL	IVCE
 *
 * Bit 7 – SRE: 外部SRAM/XMEM 使能
 * Bit 6 – SRW10: 等待状态选择位
 *
 * Bit 5 – SE: 睡眠使能
 * 		为了使MCU 在执行SLEEP 指令后进入睡眠模式， SE 必须置位。为了确保进入睡眠模
 * 		式是程序员的有意行为，建议仅在SLEEP 指令的前一条指令置位SE。一旦唤醒立即清
 * 		除SE。
 * Bits 4..2 – SM2..0: 睡眠模式选择位
 *
 * 		SM2	SM1	SM0	睡眠模式
 * 		0	0	0	空闲模式
 * 		0	0	1	ADC 噪声抑制模式
 * 		0	1	0	掉电模式
 * 		0	1	1	省电模式
 * 		1	0	0	保留
 * 		1	0	1	保留
 * 		1	1	0	Standby 模式
 * 		1	1	1	扩展的Standby 模式
 *
 * Bit 1 – IVSEL: 中断向量选择
 * 		当IVSEL 为"0"时，中断向量位于Flash 存储器的起始地址；当IVSEL 为"1"时，中断向
 * 		量转移到Boot 区的起始地址。
 * 		为了防止无意之间改变中断向量表，修改IVSEL 时需要遵照如下过程:
 * 		置位中断向量修改使能位IVCE。
 * 		在紧接的4 个时钟周期里将需要的数据写入IVSEL，同时对IVCE 写"0"。
 * Bit 0 – IVCE: 中断向量修改使能
 *		改变IVSEL 时IVCE 必须置位。在IVCE 或IVSEL 写操作之后4 个时钟周期， IVCE 被
 *		硬件清零。
*************************************************************************************************************************/

#define SIM_MCUSR			MCUCSR					// MCU 状态寄存器
/*************************************************************************************************************************
 *	7		6		5		4		3		2		1		0
 *	JTD		–		–		JTRF	WDRF	BORF	EXTRF	PORF
 *
 * Bit 7 – JTD: JTAG 接口禁用
 * Bit 4 – JTRF: JTAG 复位标志
 * Bit 3 – WDRF: 看门狗复位标志
 * Bit 2 – BORF: 掉电检测复位标志
 * Bit 1 – EXTRF: 外部复位标志
 * Bit 0 – PORF: 上电复位标志
*************************************************************************************************************************/


#define EXT_RAM_DDR			DDRC					// 高位地址屏蔽相关IO端口寄存器

#define EXT_RAM_PORT		PORTC					// 高位地址屏蔽相关IO端口寄存器

/*************************************************************************************************************************
 * 														控制参数定义
*************************************************************************************************************************/


/*************************************************************************************************************************
 * 														结构体定义
*************************************************************************************************************************/
typedef struct SSimControl
{
	uint8				state;					// 状态字

	void (*pInit)(void);						// 初始化函数
	void (*pEnableExtRam)(void);				// 使能外部RAM
	void (*pDisableExtRam)(void);				// 使能外部RAM
	void (*pSetXtalDivide)(uint8 val);			// 时钟分频设置
	void (*pEnableXtalDivide)(void);			// 时钟分频使能
	void (*pDisableXtalDivide)(void);			// 时钟分频禁用
	void (*pReset)(void);						// 重启

}SIM_CONTROL_STRUCT;


/*************************************************************************************************************************
 * 														 控制结构体声明
*************************************************************************************************************************/
SIM_EXT SIM_CONTROL_STRUCT sim_control;


/*************************************************************************************************************************
 * 														 函数声明
*************************************************************************************************************************/


#endif
/*************************************************************************************************************************
** 														文件结束
*************************************************************************************************************************/
